Перем КаталогПакетов Экспорт;
Перем ОтправлятьУведомлениеВТелеграмм Экспорт;
Перем ИдентификаторГруппыУведомленияВТелеграмм Экспорт;
Перем АдресChatNotifier Экспорт;
Перем ЛогинChatNotifier Экспорт;
Перем ТокенChatNotifier Экспорт;

Процедура ПрочитатьНастройки()

	ОтправлятьУведомлениеВТелеграмм = Ложь;
	Значение = ПолучитьПеременнуюСреды("OSHUB_TG_NOTIFICATION");
	Если ЗначениеЗаполнено(Значение) Тогда
		Если СтрСравнить(Значение, "true") = 0 
			Или СтрСравнить(Значение, "истина") = 0 
			Или СтрСравнить(Значение, "yes") = 0
			Или СтрСравнить(Значение, "да") = 0 Тогда

			ОтправлятьУведомлениеВТелеграмм = Истина;

		КонецЕсли;
	КонецЕсли;

	ИдентификаторГруппыУведомленияВТелеграмм = ПолучитьПеременнуюСреды("TELEGRAM_GROUP_ID");

	АдресChatNotifier = ПолучитьПеременнуюСреды("CHAT_NOTIFIER_URL");
	ЛогинChatNotifier = ?(ПустаяСтрока(ПолучитьПеременнуюСреды("CHAT_NOTIFIER_LOGIN")), "api", ПолучитьПеременнуюСреды("CHAT_NOTIFIER_LOGIN"));
	ТокенChatNotifier = ПолучитьПеременнуюСреды("CHAT_NOTIFIER_TOKEN");

КонецПроцедуры

КаталогПакетов = "download";
ОтправлятьУведомлениеВТелеграмм = Ложь;

ПрочитатьНастройки();
